package cn.huangdayu.almanac.test;

import cn.huangdayu.almanac.dto.AlmanacDTO;
import cn.huangdayu.almanac.dto.TimeZoneDTO;
import cn.huangdayu.almanac.utils.AlmanacUtils;
import com.alibaba.fastjson.JSON;
import org.junit.Test;

import java.util.Map;

public class TDDTest {

    @Test
    public void test1995() {
        TimeZoneDTO[] timeZoneDTOS = {
                new TimeZoneDTO("广东省", "徐闻县", "2018-11-01 11:06:48"),
//                new TimeZoneDTO("广东省", "徐闻县", "1995-08-12 11:10:10"),
//                new TimeZoneDTO("广东省", "徐闻县", "1-1-1 11:10:10")
        };
        for (int i = 0; i < timeZoneDTOS.length; i++) {
            TimeZoneDTO timeZoneDTO = timeZoneDTOS[i];
            AlmanacDTO almanacDTO = AlmanacUtils.ofDay(timeZoneDTO);
            TestUtils testUtils = new TestUtils();
            testUtils.pakMap(almanacDTO);
            for (String text : TEXTS) {
                String[] keys = text.split(" \\| ");
                String key = " " + keys[0] + " | ";
                String value = keys[1] + " | ";
                String valueTarget = testUtils.getMap().get(key);
                System.out.println(value + " , " + valueTarget + " , " + value.equalsIgnoreCase(valueTarget));
            }

        }

    }

    private static final String TEXT = "| `日期` | 2018年11月01日 | 1995年08月12日 | 0001年01月01日 |\n" +
            "| `时间` | 11时06分48秒667毫秒 | 11时10分10秒00毫秒 | 11时10分10秒00毫秒 |\n" +
            "| `星期` | 星期四 | 星期六 | 星期一 |\n" +
            "| `地点` | 广东 徐闻 | 广东 徐闻 | 广东 徐闻 |\n" +
            "| `年号` | [当代]新中国 公历纪元2018年 | [当代]新中国 公历纪元1995年 | [西汉]平帝 刘衍 元始1年 |\n" +
            "| `农历` | 戊戌狗年玖月廿四 | 乙亥猪年柒月十七 | 庚申鸡年冬月十八 |\n" +
            "| `时辰` | 午时 | 午时 | 午时 |\n" +
            "| `黄历` | 戊戌年壬戌月丁酉日丙午时 | 乙亥年甲申月乙亥日壬午时 | 庚申年戊子月丁丑日丙午时 |\n" +
            "| `天干` | 戊壬丁丙 | 乙甲乙壬 | 庚戊丁丙 |\n" +
            "| `地支` | 戌戌酉午 | 亥申亥午 | 申子丑午 |\n" +
            "| `八字` | 戊戌壬戌丁酉丙午 | 乙亥甲申乙亥壬午 | 庚申戊子丁丑丙午 |\n" +
            "| `回历` | 1440年2月21日 | 1416年3月15日 | -640年5月16日 |\n" +
            "| `儒略日` | 2458424 | 2449942 | 1721426 |\n" +
            "| `黄帝纪年` | 开元4716年 | 开元4693年 | 开元2698年 |\n" +
            "| `生肖` | 狗 | 猪 | 鸡 |\n" +
            "| `节假日` | 无 | 无 | 一九第8天  |\n" +
            "| `经度` | 东经 110°16'67\" | 东经 110°16'67\" | 东经 110°16'67\" |\n" +
            "| `纬度` | 北纬 20°33'33\" | 北纬 20°33'33\" | 北纬 20°33'33\" |\n" +
            "| `时区` | +0800 东八区 | +0800 东八区 | +0800 东八区 |\n" +
            "| `港口` | 乌石港   | 乌石港   | 乌石港   |\n" +
            "| `昼长` | 11:22:55 | 12:52:48 | 10:54:50 |\n" +
            "| `夜长` | 12:37:04 | 11:07:11 | 13:05:09 |\n" +
            "| `天亮` | 06:18:41 | 05:55:05 | 06:50:20 |\n" +
            "| `日出` | 06:41:27 | 06:18:10 | 07:14:22 |\n" +
            "| `中天` | 12:22:54 | 12:44:34 | 12:41:47 |\n" +
            "| `日落` | 18:04:22 | 19:10:58 | 18:09:12 |\n" +
            "| `天黑` | 18:27:07 | 19:34:03 | 18:33:14 |\n" +
            "| `月出` | 00:13:02 | 20:13:13 | 03:35:37 |\n" +
            "| `月中` | 06:55:44 | 13:52:54 | 09:30:08 |\n" +
            "| `月落` | 13:38:27 | 07:32:35 | 15:24:39 |\n" +
            "| `月相` | 下弦 00:40:14 | 无 | 无 |\n" +
            "| `月天数` | 30天 | 30天 | 30天 |\n" +
            "| `大月否` | 是 | 是 | 是 |\n" +
            "| `闰月否` | 否 | 否 | 否 |\n" +
            "| `闰年否` | 否 | 是 | 否 |\n" +
            "| `星座` | 天蝎座 | 狮子座 | 摩羯座 |\n" +
            "| `下一节气` | 2018-11-07 19:31:39 立冬 | 1995-08-23 22:34:50 处暑 | 1-01-06 20:41:46 小寒 |\n" +
            "| `春分` | 2018-03-21 00:15:24  | 1995-03-21 10:14:27  | 1-03-23 05:43:49  |\n" +
            "| `夏至` | 2018-06-21 18:07:12  | 1995-06-22 04:34:22  | 1-06-25 04:53:32  |\n" +
            "| `秋分` | 2018-09-23 09:54:01  | 1995-09-23 20:13:00  | 1-09-25 15:39:49  |\n" +
            "| `冬至` | 2018-12-22 06:22:38  | 1995-12-22 16:16:47  | 1-12-23 08:19:28  |\n";

    private static final String[] TEXTS = TEXT.split("\n");
}
